Revit 2024 API
StructuralSettings.GetLoadForceVectorReprLine Method
 Returns the representative line of the load force vector according to loads display scaling.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public XYZ GetLoadForceVectorReprLine(
	LoadType loadType,
	XYZ forceVector
)
Visual Basic
Public Function GetLoadForceVectorReprLine ( _
	loadType As LoadType, _
	forceVector As XYZ _
) As XYZ
Visual C++
public:
XYZ^ GetLoadForceVectorReprLine(
	LoadType loadType,
	XYZ^ forceVector
)
Parameters
loadType
Type: Autodesk.Revit.DB.Structure.LoadType
 LoadType::Point, Line, or Area
forceVector
Type: Autodesk.Revit.DB.XYZ
 The load force vector in internal units.
Return Value
 The the representative line in internal units.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
StructuralSettings Class
Autodesk.Revit.DB.Structure Namespace